# Install mas first to allow installing apps from Mac App Store
brew "mas"

# Install apps from Mac App Store
mas "Monosnap", id: 540348655  # screenshot capture/edit

cask "1Password"    # password management
cask "backblaze"    # remote file backup
cask "brave-browser"    # privacy-centric browser based on Chromium
cask "caskroom/fonts/font-hack-nerd-font"  # font for terminal and coding
cask "docker"   # container management
cask "firefox"  # browser
cask "google-backup-and-sync"   # new version of Google Drive locally
cask "iterm2"   # terminal replacement
cask "jetbrains-toolbox"    # installer for JetBrains IDEs
cask "karabiner-elements"   # keyboard remapper
cask "macdown"  # markdown editor with previewer
cask "ngrok"    # reverse SSH proxy
cask "opera"    # browser
cask "qlcolorcode"  # formatting for QuickLook color syntax
cask "qlmarkdown"   # formatting for QuickLook markdown
cask "quicklook-csv"    # show .csv files in QuickLook
cask "quicklook-json"   # format .json files in QuickLook
case "sizeup"   # window management (paid)
cask "suspicious-package"   # inspect .pkg files with QuickLook before running
cask "visual-studio-code"   # IDE/text editor
cask "webpquicklook"    # show .webp images in QuickLook

brew "black"    # python code formatter
brew "cjbassi/gotop/gotop"  # graphical top command (process monitor)
brew "coreutils"            # gnu core utilities
brew "ctags"    # build tags for quick vim navigation through code
brew "drone/drone/drone"    # Drone.io CI/CD
brew "findutils"    # GNU `find`, `locate`, `updatedb`, `xargs`
brew "fzf"      # fuzzy finder for terminal and vim
brew "git"      # version control
brew "gnu-sed"  # GNU version of sed that supports more standard options 
brew "gnupg"    # GPG for signing git commits
brew "go"       # Go programming language
brew "httpie"   # easier to use than curl
brew "hub"      # CLI for creating new repos in GitHub
brew "hugo"     # static site generator (used for ansonvandoren.com)
brew "jq"       # json parser on command line
brew "node"     # node.js for server-side javascript. If multiple versions needed, use nvm instead
brew "numpy"    # python library for numeric analysis
brew "opencv"   # imaging library
brew "openssh"  # replace default macOS SSH
brew "prettier" # code formatter for HTML/CSS/JS
brew "python"   # python3
brew "the_silver_searcher"  # code searching tool, similar to ack, but faster
brew "tldr"     # human-readable, community-driven man page replacement
brew "tmux"     # terminal multiplexer for easy use of tabs/windows/spaces in terminal
brew "tree"     # like `ls`, but shows hierarchical tree
brew "vim"      # better than emacs
brew "watchman" # used for watching for changes in large numbers of files
brew "webpack"  # web development bundler
brew "yarn"     # package manager for javascript, similar to npm
brew "zsh"      # shell replacement
brew "zsh-completions"          # terminal completions for zshell
brew "zsh-syntax-highlighting"  # colorful zshell

