cask "iterm2"   # terminal replacement
# cask "jetbrains-toolbox"    # installer for JetBrains IDEs
cask "karabiner-elements"   # keyboard remapper
cask "qlcolorcode"  # formatting for QuickLook color syntax
cask "qlmarkdown"   # formatting for QuickLook markdown
cask "quicklook-csv"    # show .csv files in QuickLook
cask "quicklook-json"   # format .json files in QuickLook
cask "sizeup"   # window management (paid)
cask "suspicious-package"   # inspect .pkg files with QuickLook before running
cask "visual-studio-code"   # IDE/text editor
cask "webpquicklook"    # show .webp images in QuickLook

brew "bat"      # replacement for cat
brew "black"    # python code formatter
brew "cjbassi/gotop/gotop"  # graphical top command (process monitor)
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "findutils"
brew "fzf"      # fuzzy finder for terminal and vim
brew "git"      # version control
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "httpie"
brew "jq"
brew "node"     # node.js for server-side javascript. If multiple versions needed, use nvm instead
brew "noti"     # get notifications on completion of long-running tasks
brew "numpy"    # python library for numeric analysis
brew "opencv"   # imaging library
brew "openssh"  # replace default macOS SSH
brew "pinentry-mac"         # for gpg2/gnupg
brew "prettier" # code formatter for HTML/CSS/JS
brew "python"   # python3
brew "ssh-copy-id"          # to send ssh credentials
brew "the_silver_searcher"  # code searching tool, similar to ack, but faster
brew "tldr"     # human-readable, community-driven man page replacement
brew "tmate"
brew "tmux"     # terminal multiplexer for easy use of tabs/windows/spaces in terminal
brew "tree"     # like `ls`, but shows hierarchical tree
brew "neovim"   # better than emacs
brew "watchexec"    # watch a file or director and run command on change
brew "watchman" # used for watching for changes in large numbers of files
brew "webpack"  # web development bundler
brew "yarn"     # package manager for javascript, similar to npm
brew "z"        # jump around - 'frecency' replacement for `cd`
brew "zsh-completions"          # terminal completions for zshell
brew "zsh-syntax-highlighting"  # colorful zshell

